// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   DevicesStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell help command
// 
// Revision History: 
// 
// --*/

/=#


#langdef   eng "English"
#langdef   fra "Français"

#string STR_SHELLENV_PROTID_DEVICES_BAD_LANG  #language eng  "%hs: Invalid language value '%hs'.\n"

#string STR_SHELLENV_PROTID_HC_T_DN    #language eng  "%HC  T   D%N\n"

#string STR_SHELLENV_PROTID_HT_Y_C_IN  #language eng  "%HT  Y C I%N\n"

#string STR_SHELLENV_PROTID_HR_P_F_AN  #language eng  "%HR  P F A%N\n"

#string STR_SHELLENV_PROTID_HL_ECGPDC_N #language eng  "%HL  E G G #P #D #C Device Name%N\n"

#string STR_SHELLENV_PROTID_H_EQUAL_SIGNS #language eng  "%H== = = = == == == =============================================================%N\n"

#string STR_SHELLENV_PROTID_ONE_VAR_H02 #language eng  "%h02x"

#string STR_SHELLENV_PROTID_ONE_VAR_D  #language eng  " %2d"

#string STR_SHELLENV_PROTID_UNKNOWN_2  #language eng  "<UNKNOWN>\n"

#string STR_SHELLENV_PROTID_ONE_VAR_S_SPACE #language eng  " %s\n"

#string STR_HELPINFO_DEVICES_SYNTAX    #language eng  "DEVICES [-b] [-l XXX]\n"

#string STR_HELPINFO_DEVICES_LINEHELP  #language eng  "Displays the list of devices being managed by EFI drivers"

#string STR_HELPINFO_DEVICES_VERBOSEHELP #language eng "Displays the list of devices being managed by EFI drivers\n"
                                                      "\n"
                                                      "DEVICES [-b] [-l XXX]\n"
                                                      "\n"
                                                      "    -b       - Displays one screen at a time\n"
                                                      "    -l XXX   - Displays devices using the ISO 639-2 language specified by XXX\n"
                                                      "\n"
                                                      "Display Format:\n"
                                                      "    CTRL         - The handle number of the EFI device\n"
                                                      "    TYPE         - The device type.\n"
                                                      "                     [R] Root Controller\n"
                                                      "                     [B] Bus Controller\n" 
                                                      "                     [D] Device Controller\n"
                                                      "    CFG          - A managing driver supports the Driver Configuration Protocol\n"
                                                      "    DIAG         - A managing driver supports the Driver Diagnostics Protocol\n"
                                                      "    #P           - The number of parent controllers that the device has\n"
                                                      "    #D           - The number of drivers that are managing the device\n"
                                                      "    #C           - The number of child controllers this device has produced\n"
                                                      "    DEVICE NAME  - The name of the device from the Component Name Protocol\n"
                                                      "\n"
                                       